// Объект - это ссылочный тип. Переменная, которой присваивается ссылка на объект содержит ссылку на объект, который находится в другом месте памяти.
const myCity = {
  city: "New York",
  popular: true,
  country: "USA",
};
//где city - имя свойства, а 'New York' - значение свойства.
console.log("-------------------------------------------------------------------");
//Порядок свойств в объектах не принципиален. Два объекта ниже идентичны
const myCity0 = {
  city: "New York",
  popular: true,
  country: "USA",
};
console.log("-------------------------------------------------------------------");
const myCity01 = {
  popular: true,
  country: "USA",
  city: "New York",
};
console.log("-------------------------------------------------------------------");
//Как получать доступ к свойствам и их значениям
console.log(myCity.city); //Получаем свойства New York
console.log(myCity.popular); //Получаем свойства true
console.log("-------------------------------------------------------------------");
//Точка между именем объекта и его свойством, например myCity.popular, называется точечная запись (Dot notation)
//Изменение значений свойств
const myCity1 = {
  city: "New York",
};
myCity1.city = "Las Vegas";
console.log(myCity1); //{city = 'Las Vegas'}
console.log("-------------------------------------------------------------------");
//Добавление новых свойств в объект
const myCity2 = {
  city: "New York",
};
myCity2.popular = true;
console.log(myCity2); //{ city: 'New York', popular: true }
myCity2.country = "USA";
console.log(myCity2); //{ city: 'New York', popular: true, country: 'USA' }
console.log("-------------------------------------------------------------------");
//Удаление свойств в объектах
const myCity3 = {
  city: "New York",
  popular: true,
  country: "USA",
};
delete myCity3.country;
console.log(myCity3); //{ city: 'New York', popular: true }
console.log("-------------------------------------------------------------------");
//Доступ к значению свойства с использованием скобок
const myCity4 = {
  city: "New York",
};
myCity4["popular"] = true;
console.log(myCity4); //{ city: 'New York', popular: true }
const countryPropertyName = "country";
myCity4[countryPropertyName] = "USA";
console.log(myCity4); //{ city: 'New York', popular: true, country: 'USA' }
console.log("-------------------------------------------------------------------");
//Вложенные свойства объектов
const myCity5 = {
  city: "New York",
  info: {
    isPopular: true,
    country: "USA",
  },
};
//где info - это вложенный объект
console.log(myCity5.info.isPopular); // True
delete myCity5.info["isPopular"];
console.log(myCity5); //{ city: 'New York', info: { country: 'USA' } }
console.log("-------------------------------------------------------------------");
console.log("-------------------------------------------------------------------");
console.log("-------------------------------------------------------------------");
console.log("-------------------------------------------------------------------");
console.log("-------------------------------------------------------------------");
console.log("-------------------------------------------------------------------");
console.log("-------------------------------------------------------------------");
console.log("-------------------------------------------------------------------");
console.log("-------------------------------------------------------------------");
console.log("-------------------------------------------------------------------");
console.log("-------------------------------------------------------------------");
console.log("-------------------------------------------------------------------");
console.log("-------------------------------------------------------------------");
console.log("-------------------------------------------------------------------");
console.log("-------------------------------------------------------------------");
console.log("-------------------------------------------------------------------");
console.log("-------------------------------------------------------------------");
console.log("-------------------------------------------------------------------");
console.log("-------------------------------------------------------------------");
console.log("-------------------------------------------------------------------");
console.log("-------------------------------------------------------------------");
console.log("-------------------------------------------------------------------");
console.log("-------------------------------------------------------------------");
console.log("-------------------------------------------------------------------");